# Python Pandas: A sample analysis

In Python, the package "pandas" is a highly effective way to analyse numerical and analytical data. The best way to demonstrate this is by showing below an example, using a sample dataset for the Titanic.

First, we need to import the packages that will be used. Numpy is a package that pandas builds off of, so we will import both of them. Additionally, we will import seaborn, as this will provide us with the dataset.

In [161]:
import numpy as np
import pandas as pd
import seaborn as sns

Load the titanic dataset using seaborn. pip install seaborn, 'import seaborn as sns', then load using 'sns.load_dataset('titanic')'
Clean the dataset: 
Where are the missing values, can they be filled/need to be dropped? - df.isnull(), df.fillna(), df.dropna()
Are there any duplicates? - df.duplicated(), df.drop_duplicates()
Do any columns need renaming? - df.rename()
Any other data quality concepts you can check?
Check the descriptive statistics - df.describe()
Find the average fare and age for each class - df.groupby(), mean()
Add a new column showing the fare as a percentage of total
How many survivors were female compared to male?
What interesting insights can you draw?

In [162]:
sns.load_dataset('titanic')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [163]:
df = sns.load_dataset('titanic')
print(df.isna().sum())
df.isna()['age']
df['alone'].sort_values()
df = df.drop("deck",axis=1)
#for y in df['age']:
# for y in df['age']:
#     if (df['age'][y]).isnan == 19.0:
#         print('19')
#     else:
#         print('no')
# NaN_check = True
# sum_of_nans = 0
# print(df['age'].isna() == NaN_check)
# for i in df['age']:
#     if (np.isnan(i)) == True:
#         print(df.drop)
        

ndf = df.dropna()
ndf.isna().sum()
# for i in df['sex']:
#     if df['sex'][i] == 'male':
#         print(df['sex'])
# 
ndf.duplicated().sum()
ndf = ndf.drop_duplicates()
# ndf.duplicated().sum()
ndf = ndf.drop("who", axis=1)
ndf
print(ndf['sibsp'].sum())
# sum_of_alone = 0
# for alone in ndf['alone']:
#     if alone == True:
#         sum_of_alone += 1

# print(sum_of_alone)

# ndf['alone'].query(True)
ndf = ndf.drop("pclass", axis=1)
ndf = ndf.drop("embarked", axis=1)
ndf = ndf.rename(columns= {"embark_town":"embarked from"})
ndf

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64
362

,survived,sex,age,sibsp,parch,fare,class,adult_male,embarked from,alive,alone
0,0,male,22.0,1,0,7.2500,Third,True,Southampton,no,False
1,1,female,38.0,1,0,71.2833,First,False,Cherbourg,yes,False
2,1,female,26.0,0,0,7.9250,Third,False,Southampton,yes,True
3,1,female,35.0,1,0,53.1000,First,False,Southampton,yes,False
4,0,male,35.0,0,0,8.0500,Third,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...
883,0,male,28.0,0,0,10.5000,Second,True,Southampton,no,True
885,0,female,39.0,0,5,29.1250,Third,False,Queenstown,no,False
887,1,female,19.0,0,0,30.0000,First,False,Southampton,yes,True
889,1,male,26.0,0,0,30.0000,First,True,Cherbourg,yes,True
890,0,male,32.0,0,0,7.7500,Third,True,Queenstown,no,True

In [164]:
ndf.describe()

         survived         age       sibsp       parch        fare
count  674.000000  674.000000  674.000000  674.000000  674.000000
mean     0.416914   29.752849    0.537092    0.455490   35.720580
std      0.493415   14.693174    0.947016    0.871511   54.101153
min      0.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000   20.000000    0.000000    0.000000    8.050000
50%      0.000000   28.000000    0.000000    0.000000   16.100000
75%      1.000000   39.000000    1.000000    1.000000   34.584400
max      1.000000   80.000000    5.000000    6.000000  512.329200

In [165]:
(ndf.groupby(['class'],).mean(True))

/tmp/ipykernel_21459/2778014560.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  (ndf.groupby(['class'],).mean(True))

,survived,age,sibsp,parch,fare,adult_male,alone
class,,,,,,,
First,0.653846,38.051758,0.461538,0.417582,88.489035,0.532967,0.450549
Second,0.500000,29.859684,0.455696,0.443038,22.168223,0.500000,0.506329
Third,0.248503,25.180150,0.616766,0.482036,13.377507,0.613772,0.613772

In [166]:
ndf['% of fare total'] = (ndf['fare'] / ndf['fare'].sum()) * 100
ndf

,survived,sex,age,sibsp,parch,fare,class,adult_male,embarked from,alive,alone,% of fare total
0,0,male,22.0,1,0,7.2500,Third,True,Southampton,no,False,0.030113
1,1,female,38.0,1,0,71.2833,First,False,Cherbourg,yes,False,0.296080
2,1,female,26.0,0,0,7.9250,Third,False,Southampton,yes,True,0.032917
3,1,female,35.0,1,0,53.1000,First,False,Southampton,yes,False,0.220555
4,0,male,35.0,0,0,8.0500,Third,True,Southampton,no,True,0.033436
...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,male,28.0,0,0,10.5000,Second,True,Southampton,no,True,0.043612
885,0,female,39.0,0,5,29.1250,Third,False,Queenstown,no,False,0.120973
887,1,female,19.0,0,0,30.0000,First,False,Southampton,yes,True,0.124607
889,1,male,26.0,0,0,30.0000,First,True,Cherbourg,yes,True,0.124607
890,0,male,32.0,0,0,7.7500,Third,True,Queenstown,no,True,0.032190

In [201]:
ndf['survived'][ndf['survived'] == 1].count()

ndf.groupby(['sex','survived']).describe()

                   age                                                        \
                 count       mean        std   min    25%   50%    75%   max
sex    survived
female 0          64.0  25.046875  13.618591  2.00  16.75  24.5  33.25  57.0
       1         189.0  28.652116  14.006161  0.75  19.00  28.0  36.00  63.0
male   0         329.0  32.007599  14.375488  1.00  22.00  29.0  40.00  74.0
       1          92.0  27.224674  16.587770  0.42  17.75  27.5  36.00  80.0

                 sibsp            ...      fare           % of fare total  \
                 count      mean  ...       75%       max           count
sex    survived                   ...
female 0          64.0  0.968750  ...  27.90000  151.5500            64.0
       1         189.0  0.539683  ...  77.95830  512.3292           189.0
male   0         329.0  0.486322  ...  27.72080  263.0000           329.0
       1          92.0  0.413043  ...  52.13855  512.3292            92.0

                                                                             \
                     mean       std       min       25%       50%       75%
sex    survived
female 0         0.094585  0.105897  0.028037  0.040562  0.063852  0.115885
       1         0.234065  0.283527  0.030010  0.053996  0.109031  0.323805
male   0         0.100384  0.139814  0.000000  0.032623  0.043612  0.115140
       1         0.181327  0.320063  0.000000  0.038589  0.109187  0.216561


                      max
sex    survived
female 0         0.629474
       1         2.127996
male   0         1.092389
       1         2.127996

[4 rows x 40 columns]